import React, { useEffect, useState } from 'react'
import Collapsible from 'react-collapsible';
import { Link } from 'react-router-dom';
import apiService from '../../../api.service';


import './Punjabi.css'
function Punjabi() {
    let [data, setData] = useState([]);
    useEffect(() => {
        apiService.getNewsPunjabi().then(data => setData(data))
    }, [])
    let newsData = [
        {
            id: 1,
            title: 'ਇੱਕੋ ਨਾਹਰਾ - ਲੜਾਂਗੇ, ਜਿੱਤਾਂਗੇ!',
            writter: 'ਲੇਖਕ: ਸੁਖਦਰਸ਼ਨ ਨੱਤ',
            description: [
                "ਅਸੀਂ ਪੰਜਾਬ ’ਚ ਲੰਬੀ ਲੜਾਈ ਲੜਨ ਤੋਂ ਬਾਅਦ ਅੜੀਅਲ ਮੋਦੀ ਸਰਕਾਰ ਨੂੰ ਲੀਹ ’ਤੇ ਲਿਆਉਣ ਲਈ ਨਾਹਰਾ ਦਿੱਤਾ ਸੀ ‘26-27 ਨਵੰਬਰ ਨੂੰ ਦਿੱਲੀ ਚੱਲੋ’। ਮੋਦੀ ਸਰਕਾਰ ਨੇ ਸਾਡੇ ਐਲਾਨ ਨੂੰ ਫੋਕਾ ਦਬਕਾ ਸਮਝਿਆ। ਆਪਣੇ ਹਰਿਆਣੇ ਦੇ ਸੰਘੀ ਮੁੱਖ-ਮੰਤਰੀ ਖੱਟੜ ਨੂੰ ਸਾਨੂੰ ਠੱ ਲਣ-ਰੋਕਣ ਦਾ ਹੁਕਮ ਦੇ ਕੇ ਮੋਦੀ ਨਿਸਚਿੰਤ ਹੋ ਗਿਆ ਕਿ ਚਲੋ ਹੁਣ ਇਹ ਮਹੀਨਾ-ਖੰਡ ਪੰਜਾਬ-ਹਰਿਆਣਾ ਬਾਰਡਰ ’ਤੇ ਬੈਠਣਗੇ ਅਤੇ ਅੱਕ-ਥੱਕ ਕੇ ਘਰਾਂ ਨੂੰ ਮੁੜ ਜਾਣਗੇ। ਪਰ ਸਾਡੇ ਮਸ਼ੀਨਰੀ ਦੇ ਮਾਹਰ ਜੋਸ਼ੀਲੇ ਕਿਸਾਨ ਨੌਜਵਾਨਾਂ ਨੇ ਉਨ੍ਹਾਂ ਦੀਆਂ ਸਾਰੀਆਂ ਸਕੀਮਾਂ ਉਤੇ ਪਾਣੀ ਫੇਰ ੱ ਦਿੱਤਾ। ਪਹਿਲ ਸਾਡੇ ਹਰਿਆਣੇ ਵਾਲੇ ਨੌਜਵਾਨ ਵੀਰਾਂ ਨੇ ਕੀਤੀ। ਉਨ੍ਹਾਂ 25 ਨਵੰਬਰ ਨੂੰ ਹੀ ਅੰਬਾਲਾ, ਕਰਨਾਲ ਅਤੇ ਪਾਣੀਪਤ ਵਿਖੇ ਕੀਤੀਆਂ ਪੁਲਸ ਦੀਆਂ ਮਜਬੂਤ ਕਿਲ੍ਹੇਬੰਦੀਆਂ ਨੂੰ ਪਲਾਂ ਘੜੀਆਂ ਵਿੱਚ ਟਰੈਕਟਰਾਂ ਦੇ ਟਾਇਰਾਂ ਹੇਠ ਦਰੜਦੇ ਹੋਏ, ਮਾਰੂਥਲ ਲੰਘ ਕੇ ੍ਹ ਦਿੱਲੀ ਦੀਆਂ ਬਰੂਹਾਂ ਉਤੇ ਪਹੁੰਚ ੱ ਦਸਤਕ ਦੇ ਦਿੱਤੀ। ਉਨ੍ਹਾਂ ਤੋਂ ਪ੍ਰੇਰਿਤ ਹੋ ਕੇ ਪੰਜਾਬ ਦੇ ਨੌਜਵਾਨਾਂ ਅਤੇ ਜਥੇਬੰਦ ਕਿਸਾਨਾਂ ਨੇ ਵੀ ਸ਼ੰਭੂ, ਖਨੌਰੀ, ਪਹੇਵਾ, ਰਤੀਆ ਆਦਿ ਸਮੂਹ ਨਾਕਿਆਂ ਨੂੰ ਤੋੜਦੇ ਹੋਏ, ਅੱਥਰੂ ਗੈਸ ਅਤੇ ਸਰਦ ਮੌਸਮ ਵਿੱਚ ਪਾਣੀ ਦੀਆਂ ਬੁਛਾੜਾਂ ਦਾ ਸਾਹਮਣਾ ਕਰਦਿਆਂ, ਟਨਾਂ ਭਰੇ ਕੰਕਰੀਟ ਬਲਾਕਾਂ, ਬੈਰੀਕੇਡਾਂ, ਬਲੇਡ ਦੀ ਧਾਰ ਵਰਗੀਆਂ ਕੰਡੇਦਾਰ ਤਾਰਾਂ ਦੀਆਂ ਵਾੜਾਂ, ਮਿੱਟੀ ਦੇ ਢੇਰਾਂ, ਸੜਕਾਂ ’ਚ ਪੱਟੀਆਂ ਡੂੰਘੀਆਂ ਖਾਈਆਂ ਅਤੇ ਰਾਹ ਰੋਕਣ ਲਈ ਖੜ ਕੀਤੇ ਹੇ੍ ਟਿੱਪਰਾਂ-ਟਰੱਕਾਂ ਨੂੰ ਧੱਕਦੇ-ਉਲੰਘਦੇ ਆਪਣੇ ਹਰਿਆਣਵੀ ਕਿਸਾਨ ਭਰਾਵਾਂ ਦੇ ਮੋਢੇ ਨਾਲ ਮੋਢਾ ਲਾਉਣ ਲਈ ਦਿੱਲੀ ਬਾਰਡਰ ਉਤੇ ਆ ਧਮਕੇ। ਪੰਜਾਬ ੱ ਅਤੇ ਹਰਿਆਣਾ ਦੀਆਂ ਦਰਜਨਾਂ ਕਿਸਾਨ ਜਥੇਬੰਦੀਆਂ ਦੇ ਝੰਡਿਆਂ ਨਾਲ ਸਜੀਆਂ ਤਰਪਾਲਾਂ ’ਚ ਲਿਪਟੀਆਂ ਟੈਂਕਾਂ ਵਰਗੀਆਂ ਟਰਾਲੀਆਂ ਦਾ ਅਮੁੱਕ ਕਾਫ਼ਲਾ, ਟਰੈਕਟਰਾਂ ਦੇ ਸਪੀਕਰ ਤੋਂ ਵੰਗਾਰਵੀਆਂ ਸੁਰਾਂ ਵਿੱਚ ਗੂੰਜਦੇ ਸੰਘਰਸ਼ ਦਾ ਹੋਕਾ ਦਿੰਦੇ ਗੀਤ, ਰਾਸ਼ਨ-ਪਾਣੀ ਸਮੇਤ ਨਿੱਤ ਵਰਤੋਂ ਦੀਆਂ ਹਰ ਜ਼ਰੂਰੀ ਚੀਜ਼ਾਂ ਨਾਲ ਲੈਸ ਇਹ ਕਾਫ਼ਲਾ ਸੱਚਮੁੱਚ ਇੱਕ ਵਾਰ ਮੁੜ ਦਿੱਲੀ ਫ਼ਤਹਿ ਕਰਨ ਲਈ ਕਿਸੇ ਸ਼ਕਤੀਸ਼ੀਲ ਫੌਜ ਦਾ ਪੂਰੀ ਤਰ੍ਹਾਂ ਅਨੁਸ਼ਾਸਤ ਅਤੇ ਜਥੇਬੰਦ ਕੂਚ ਜਾਪਦਾ ਹੈ।",
                "ਪੰਜਾਬ ਤੋਂ ਦਿੱਲੀ ਤੱਕ ਉਨ੍ਹਾਂ ਜਰਨੈਲੀ ਸੜਕਾਂ ਉਤੇ- ੱ ਜਿਨ੍ਹਾਂ ਉਤੇ ਆਮ ੱ ਦਿਨਾਂ ਵਿੱਚ ਵੀ ਰੋਜ਼ਾਨਾ ਸੜਕ ਹਾਦਸਿਆਂ ਵਿੱਚ ਦਰਜਨਾਂ ਜਾਨਾਂ ਜਾਂਦੀਆਂ ਨੇ- ਵਾਹੋ-ਦਾਹੀ ਜੰਗ ਲੜਦੇ ਸਾਡੇ ਨੌਜਵਾਨ ਕਿਸਾਨਾਂ ਨੇ ਇੱਕ ਵੀ ਹਾਦਸਾ ਨਾ ਕਰਕੇ ਸਾਬਤ ਕਰ ਦਿੱਤਾ ਕਿ ਉਹ ਸਿਰਫ਼ ਖੇਤਾਂ ਅਤੇ ਗੀਤਾਂ ਵਿੱਚ ਹੀ ਖੇਤੀ ਮਸ਼ੀਨਰੀ ਦੀ ਸੁਚੱਜੀ ਵਰਤੋਂ ਦੇ ਮਾਹਿਰ ਨਹੀਂ ਹਨ ਬਲਕਿ ਉਹ ਆਪਣੀ ਇਸ ਮਸ਼ੀਨੀ ਮੁਹਾਰਤ ਦੀ ਵਰਤੋਂ ਸੜਕਾਂ ਉਤੇ ਸਰਕਾਰ ੱ ਖ਼ਿਲਾਫ਼ ਸੰਘਰਸ਼ ਵਿੱਚ ਕਰਨ ਵਿੱਚ ਵੀ ਕਮਾਲ ਦੇ ਮਾਹਿਰ ਹਨ। 26-27 ਨਵੰਬਰ ਦੇ ਇਸ ਸਮੁੱਚੇ ਜੰਗੀ ਕੂਚ ਵਿੱਚ ਸਿਰਫ਼ ਇੱਕ ਕਿਸਾਨ ਯੋਧਾ ਜ਼ਿਲ੍ਹਾ ਮਾਨਸਾ ਦੇ ਪਿੰਡ ਖਿਆਲੀ ਚਹਿਲਾਂ ਵਾਲੀ ਦਾ ਨੌਜਵਾਨ ਧੰਨਾ ਸਿੰਘ ਸ਼ਹੀਦ ਹੋ ਗਿਆ। ਉਹ ਵੀ ਅੰਦੋਲਨਕਾਰੀ ਦੀ ਕਿਸੇ ਗਲਤੀ ਕਾਰਨ ਨਹੀਂ, ਬਲਕਿ ਇੱਕ ਵਪਾਰਕ ਟਰੱਕ ਦੇ ਚਾਲਕ ਦੀ ਕੁਤਾਹੀ ਕਾਰਨ।",
                "26 ਨਵੰਬਰ ਤੋਂ ਹੀ ਦਿੱਲੀ ਨੂੰ ਪੰਜਾਬ-ਹਰਿਆਣਾ, ਹਿਮਾਚਲ ਅਤੇ ਜੰਮੂ-ਕਸ਼ਮੀਰ ਨਾਲ ਜੋੜਦੇ ਕਰਨਾਲ ਤੇ ਰੋਹਤਕ ਵਾਲੇ ਦੋਵੇਂ ਪ੍ਰਮੁੱਖ ਨੈਸ਼ਨਲ ਹਾਈਵੇਅ ਜਾਮ ਹਨ। ਪੰਜ-ਚਾਰ ਦਿਨਾਂ ਬਾਅਦ ਯੂ.ਪੀ ਅਤੇ ਉਤਰਾਖੰਡ ਦੇ ਕ ੱ ਿਸਾਨਾਂ ਨੇ ਪੂਰਬ ਵੱਲ ਜਾਂਦੇ ਦੋ ਹੋਰ ਮੁੱਖ ਮਾਰਗ ਜਾਮ ਕਰ ਦਿੱਤੇ। ਹੁਣ ਸਕੀਮ ਹੈ ਕਿ ਮੋਦੀ ਸਰਕਾਰ ਦੇ ਹਲਕ ’ਚ ਫਾਨਾ ਠੋਕਣ ਲਈ ਜੈਪੁਰ ਤੇ ਆਗਰਾ ਵਾਲੇ ਦੱਖਣ ਪੱਛਮ ਦੇ ਦੋਵੇਂ ਰਾਹਾਂ ਨੂੰ ਵੀ 14 ਦਸੰਬਰ ਤੋਂ ਚੱਕਾ ਜਾਮ ਕੀਤਾ ਜਾਵੇ। ਨਤੀਜਾ ਕਿਸੇ ਵੀ ਵਰਗ ਦੀ ਹੱਕੀ ਗੱਲ ਸੁਣਨ ਤੋਂ ਪੂਰੀ ਤਰ੍ਹਾਂ ਇਨਕਾਰੀ ਰਹਿਣ ਵਾਲੀ ਮੋਦੀ ਸਰਕਾਰ, ਸਾਡੇ ਕਿਸਾਨ ਆਗੂਆਂ ਵੱਲੋਂ ਅੰਦੋਲਨ ਦੀਆਂ ਪ੍ਰਮੁੱਖ ਮੰਗਾਂ ਉਤੇ ਸਾਰੇ ਦਬਾਅ ਅਤੇ ਗੋਦੀ ੱ ਮੀਡੀਆ ਦੇ ਕੂੜ ਪ੍ਰਚਾਰ ਦੇ ਬਾਵਜੂਦ ਚੱਟਾਣ ਵਾਂਗ ਡਟੀ ਹੋਈ ਹੈ। ਇਸ ਲਈ ਹੁਣ ਉਲਟਾ ਪ੍ਰਚਾਰ ਦੇ ਦਾਅ-ਪੇਚ ਵਜੋਂ ਹੀ ਸਹੀ ਮੋਦੀ ਸਰਕਾਰ ਦੇਸ਼ ਦੇ ਅੰਦੋਲਨਕਾਰੀ ਕਿਸਾਨਾਂ ਨੂੰ ਗੱਲਬਾਤ ਲਈ ਵਾਰ-ਵਾਰ ਅਪੀਲਾਂ ਕਰਨ ਲਈ ਮਜਬੂਰ ਹੈ। ਅੰਦੋਲਨਕਾਰੀ ਨੌਜਵਾਨ, ਬਜ਼ੁਰਗ, ਮਰਦ, ਔਰਤਾਂ ਅਤੇ ਬੱਚੇ ਬਿਨਾਂ ਕਿਸੇ ਉਤਾਵਲੇਪਣ ਤੇ ਭੜਕਾਹਟ ਤੋਂ ਪੂਰੀ ਸ਼ਾਂਤੀ ਨਾਲ ਆਪਣੇ ‘ਘੇਰਾ ਡਾਲੋ - ਡੇਰਾ ਡਾਲੋ’ ਸੱਤਿਆਗ੍ਰਹਿ ਉਤੇ ਡਟੇ ਹੋਏ ਹਨ। ਹ ੱ ਰਿਆਣਾ, ਪੰਜਾਬ, ਦਿੱਲੀ ਅਤੇ ਹੋਰਨਾਂ ਸੂਬਿਆਂ ਦੇ ਕਿਸਾਨ, ਆੜਤੀ, ਦੁਕਾਨਦਾਰ, ਵਪਾਰੀ, ਸਮਾਜਿਕ-ਧਾਰਮਿਕ ਸੰਸਥਾਵਾਂ ਅਤੇ ਆਮ ਲੋਕ ਦਿਲ ਖੋਲ੍ਹ ਕੇ ਅੰਦੋਲਨਕਾਰੀ ਕਿਸਾਨਾਂ ਦੀ ਹਰ ਤਰ੍ਹਾਂ ਦੀ ਅਣਕਿਆਸੀ ਮਦਦ ਕਰ ਰਹੇ ਹਨ। ਪੰਜਾਬ ਅਤੇ ਦੇਸ਼-ਵਿਦੇਸ਼ ਦੇ ਮੀਡੀਏ ਦਾ ਇਮਾਨਦਾਰ ਅਤੇ ਨਿਰਪੱਖ ਹਿੱਸਾ, ਅੰਦੋਲਨ ਦੀਆਂ ਸਹੀ ਅਤੇ ਪ੍ਰੇਨਾਦਾਇਕ ਸੂਚਨਾਵਾਂ ਅਤੇ ਦ੍ਰਿਸ਼ ਪੂਰੀ ਦੁਨੀਆ ਦੇ ਸਾਹਮਣੇ ਪਹੁੰਚਾ ਰਿਹਾ ਹੈ। ਦੇਸ਼ ਦੇ ਨਾਲ-ਨਾਲ ਪੂਰੀ ਦੁਨੀਆ ਵਿੱਚੋਂ ਜਨਤਾ ਤੇ ਬਹੁਤ ਸਾਰੇ ਦੇਸ਼ਾਂ ਦੀਆਂ ਸਰਕਾਰਾਂ ਵੱਲੋਂ ਵੀ ਇਸ ਹੱਕੀ ਅਤੇ ਅਮਨਪੂਰਨ ਕਿਸਾਨ ਸੰਘਰਸ਼ ਨੂੰ ਵਿਆਪਕ ਹਿਮਾਇਤ ਮਿਲ ਰਹੀ ਹੈ। ਇਸ ਦਬਾਅ ਹੇਠ ਮੋਦੀ ਸਰਕਾਰ ਬੇਸ਼ੱਕ ਪਿੱਛੇ ਹਟਣ ਲਈ ਤਾਂ ਮਜ਼ਬੂਰ ਹੈ ਪਰ ਆਪਣੀ ਘੋਰ ਕਾਰਪੋਰੇਟਪ੍ਰਸਤ ਫਿਰਕੂ ਤੇ ਫਾਸਿਸਟ ਵਿਚਾਰਧਾਰਾ ਕਾਰਨ, ਇਹ ਹਾਲੇ ਵੀ ਤਿੰਨ ਖੇਤੀ ਕਾਨੂੰ ਨਾਂ ਨੂੰ ਪੂਰੀ ਤਰ੍ਹਾਂ ਰੱਦ ਕਰਨ ਲਈ ਤਿਆਰ ਨਹੀਂ।",
                "ਉਲਟਾ ਉਹ ਇਸ ਅੰਦੋਲਨ ਨੂੰ ਬਦਨਾਮ ਕਰਨ ਅਤੇ ਆਪਣੇ ਪਿੱਠੂਆਂ ਰਾਹੀਂ ਫੁੱਟ ਪਾਉਣ ਵਰਗੀਆਂ ਕਮੀਨੀਆਂ ਚਾਲਾਂ ਚੱਲ ਰਹੀ ਹੈ। ਉਹ ਅੰਦੋਲਨ ਨੂੰ ਕਿਸੇ ਵੀ ਬਹਾਨੇ ਹਿੰਸਕ ਬਣਾਉਣ ਅਤੇ ਇਸਨੂੰ ਹਮਲੇ ਦਾ ਨਿਸ਼ਾਨਾ ਬਣਾਉਣ ਦਾ ਮੌਕਾ ਤਾੜ ਰਹੀ ਹੈ। ਉਹ ਕਿਸਾਨਾਂ ਵਿੱਚ ਆਪਣੇ ਭੜਕਾਊ ਏਜੰਟ ਵਾੜ ਕੇ ਜਾਂ ਗਿਣ ਮਿੱਥ ਕੇ ਟਕਰਾਅ ਕਰਵਾ ਕੇ ਇਸ ਉਤੇ ਅਣਮਨੁੱ ਖੀ ਹਮਲਾ ਕਰਨ ੱ ਨੂੰ ਵਾਜਿਬ ਠਹਿਰਾਉਣ ਦੀ ਫ਼ਿਰਾਕ ਵਿੱਚ ਹੈ।",
                "ਕਿਸਾਨ ਵੀਰੋ, ਇੱਕਜੁੱਟ ਰਹੋ ਅਤੇ ਹਰ ਤਰ੍ਹਾਂ ਦੇ ਭੜਕਾਹਟ ਤੋਂ ਸੁਚੇਤ ਰਹੋ। ਸਥਾਨਕ ਲੋਕਾਂ ਨਾਲ ਆਪਣਾ ਪਿਆਰ ਅਤੇ ਸਹਿਯੋਗ ਬਣਾਈ ਰੱਖੋ। ਹਰ ਤਰ੍ਹਾਂ ਦੇ ਪੰਗੇਬਾਜ਼ ਤੇ ਭੜਕਾਊ ਅਨਸਰਾਂ ਤੋਂ ਸਾਵਧਾਨ ਰਹੋ, ਫਜ਼ੂਲ ਦੀਆਂ ਫੜਹਾਂ ੍ ਜਾਂ ਚੱਕਵੀਆਂ ਗੱਲਾਂ ਜਾਂ ਹੋਰਨਾਂ ਨਾਲੋਂ ਨਿਖੇੜਨ ਵਾਲੇ ਐਲਾਨਾਂ ਅਤੇ ਨਾਹਰਿਆਂ ਤੋਂ ਬਚੋ। ਸਾਡੇ ਇੱਕਜੁੱਟ, ਅਨੁਸ਼ਾਸਤ ਅਤੇ ਅਮਨਪੂਰਨ ਅੰਦੋਲਨਾਂ ਨੂੰ ਮੋਦੀ ਸਰਕਾਰ ਤਾਂ ਕੀ ਜ਼ਾਲਮ ਸਾਮਰਾਜੀ ਅੰਗਰੇਜ਼ ਸਰਕਾਰ ਵੀ ਕੁਚਲ ਨਹੀਂ ਸੀ ਸਕੀ।",
                "ਹੁਣ ਵੀ ਇਹ ਸਾਡੀ ਸ਼ਾਂਤੀ, ਸਬਰ ਅਤੇ ਅਨੁਸ਼ਾਸ਼ਨ ਦੀ ਪਰਖ ਦਾ ਵਕਤ ਹੈ। ਸੋ ਹਰ ਭੜਕਾਹਟ ਅਤੇ ਫੁੱਟ ਪਾਊ ਸਾਜਿਸ਼ ਨੂੰ ਧੀਰਜ ਅਤੇ ਚੌਕਸੀ ਨਾਲ ਨਾਕਾਮ ਕਰਦਿਆਂ ਇਸ ਚਮਤਕਾਰੀ ਨਾਹਰੇ ਉਤੇ ੱ ਟਿਕੇ ਰਹੋ – ‘ਲੜਾਂਗੇ - ਜਿੱਤਾਂਗੇ!’"
            ]

        },
        {
            id: 2,
            title: "ਸੰਪਾਦਕੀ",
            writter: "ਡਾ ਉਦੋਕ",
            description: [
                "ਕੇਂਦਰ ਸਰਕਾਰ ਵਲੋਂ ਬਣਾਏ ਗਏ ਕਿਸਾਨ ਵਿਰੋਧੀ ਕਾਨੂੰ ਨਾਂ ਦੇ ਬਣਾਏ ਜਾਣ ਤੋਂ ਬਾਅਦ,ਕਿਸਾਨ ਜਥੇਬੰਦੀਆਂ ਵਲੋਂ ਆਪਣੇ ਹੱਕਾਂ ਦੀ ਪ੍ਰਾਪਤੀ ਲਈ ਆਰੰਭਿਆ ਸੰਘਰਸ਼ ਹੁਣ ਇਕ ਵਿਆਪਕ ਲੋਕ ਲਹਿਰ ਦਾ ਦੀਰਘ ਰੂਪ ਧਾਰਨ ਕਰ ਚੁੱਕਾ ਹੈ।ਸ਼ਾਇਦ ਵਰਤਮਾਨ ਵਿੱਚ ਐਸਾ ਉਗਰ ਜਾਗ੍ਰਿਤ ਲੋਕਾਂ ਦਾ ਸ਼ਾਂਤੀ ਪੂਰਵਕ ਨਿਸ਼ਚਾ ਕਿ ਜਿਸ ਨੇ ਆਗੂ ਪ੍ਰਨਾਲੀ ਦੀ ਫੈਸਲਾ ਲੈਣ ਦੀ ਸਮਰੱਥਾ ਨੂੰ ਵੀ ਆਪਣੇ ਕਲਾਵੇ ਵਿੱਚ ਲੈ ਲਿਆ ਹੈ ਅਤੇ ਵੈਸੇ ਇਹ ਇਕ ਸ਼ੁਭ ਸੰਕੇਤ ਵੀ ਹੈ।",
                "ਪੰਜਾਬ ਜਾਂ ਦੇਸ਼ ਦੇ ਲੋਕਾਂ ਨਾਲ ਸਥਾਪਿਤ ਸਰਕਾਰਾਂ ਵਲੋਂ ਲੋਕ ਲਹਿਰਾਂ ਨੂੰ ਕੁਚਲਣ ਲਈ ਅਨੇਕਾਂ ਵਾਰ ਗੱਲਬਾਤ ਦੇ ਦੌਰਾਨ ਵਿਸਾਹਘਾਤ ਹੋਏ ਸਨ ਜਿਹਨਾਂ ਨੇ ਆਗੂਆਂ ਦੀ ਭੂਮਿਕਾ ਨੂੰ ਵੀ ਸ਼ੱਕ ਦੇ ਦਾਇਰੇ ਵਿੱਚ ਲੈ ਆਂਦਾ ਸੀ ਪਰ ਇਸ ਸੰਘਰਸ਼ ਦੌਰਾਨ ਇਕ ਐਸਾ ਆਲੌਕਿਕ ਵਰਤਾਰਾ ਵਾਪਰਿਆ ਹੈ ਅਤੇ ਲੋਕ ਮਾਨਸਿਕਤਾ ਵਿੱਚ ਇਕ ਐਸਾ ਬ੍ਰਿਤਾਂਤ ਸਿਰਜਿਆ ਗਿਆ ਹੈ ਜਿਸ ਨੇ ਆਗੂ ਵਰਗ ਉਪਰ ਦਬਾਅ ਪੈਦਾ ਕੀਤਾ ਹੈ ਅਤੇ ਉਹਨਾਂ ਨੂੰ ਹਰ ਫੈਸਲਾ ਲੈਣ ਸਮੇਂ ਲੋਕ ਹਿੱਤਾਂ ਦੀ ਨੁਮਾਂਇੰਦਗੀ ਦਾ ਅਹਿਸਾਸ ਕਰਵਾਇਆ ਹੈ।",
                "ਬੇਸ਼ਕ ਸਰਕਾਰ ਨਾਲ ਇਕ ਨਹੀਂ ਅਨੇਕਾਂ ਬੈਠਕਾਂ ਹੋ ਚੁੱਕੀਆਂ ਅਤੇ ਅਜੇ ਤੱਕ ਤਕਰੀਬਨ ਬੇਸਿੱਟਾ ਹਨ ਪ੍ਰੰਤੂ ਹਰ ਬੈਠਕ ਦੌਰਾਨ ਸਰਕਾਰ ਦਾ ਰਵੱਈਆ ਇਸ ਤੱਥ ਦਾ ਪ੍ਰਗਟਾਅ ਕਰਦਾ ਹੈ ਕਿ ਮਸਲਾ ਹੁਣ ਸਰਕਾਰ ਦੇ ਗਲੇ ਦੀ ਹੱਡੀ ਬਣ ਚੁੱਕਾ ਹੈ ਅਤੇ ਅਤੇ ਆਗੂ ਹੁਣ ਕੇਵਲ ਜਨਤਕ ਵਹਾਅ ਦੇ ਨੁਮਾਂਇੰਦੇ ਹੀ ਹਨ।ਵੈਸੇ ਸਰਕਾਰ ਵਲੋਂ ਹੁਣ ਤੱਕ ਦੀਆਂ ਹੋਈਆਂ ਬੈਠਕਾਂ ਵਿੱਚ ਜਿਸ ਤਰ੍ਹਾਂ ਦਾ ਵਤੀਰਾ ਹੈ ਉਸ ਤੋਂ ਜਿਥੇ ਉਹਨਾਂ ਦਾ ਅੜੀਅਲ ਸੁਭਾਅ ਪ੍ਰਗਟ ਹੋ ਰਿਹਾ ਹੈ ਉਥੇ ਨਾਲ ਹੀ ਇਸ ਅੜੀ ਨੂੰ ਸਥਾਪਿਤ ਧਿਰ ਦੇ ਵੱਡੇ ਆਗੂ ਦੀ ਅਹੰ ਭਾਵ ਨਾਲ ਜੁੜਿਆ ਮਹਿਸੂਸ ਕੀਤਾ ਜਾ ਸਕਦਾ ਜਾਂ ਫਿਰ ਦੂਜੇ ਸ਼ਬਦਾਂ ਵਿੱਚ ਕਿਸਾਨ ਮੰਗਾਂ ਦੀ ਪੂਰਤੀ ਅਤੇ ਕਾਨੂੰ ਨ ਵਾਪਸੀ ਦੇ ਫੈਸਲੇ ਨਾਲ ਉਹਨਾਂ ਨੂੰ ਨਰਿੰਦਰ ਮੋਦੀ ਦਾ ਲੋਹ ਪੁਰਸ਼,ਅੱਡਿਗ ਅਤੇ ਅਟੱਲ ਪ੍ਰਧਾਨਮੰਤਰੀ ਦੇ ਰੂਪ ਵਿੱਚ ਸਿਰਜਿਆ ਬਿੰਬ ਖੁਰਦਾ ਨਜ਼ਰ ਆਉਦਾ ਹੈ।",
                "ਸਰਕਾਰ ਵਲੋਂ ਕਿਸਾਨ ਜਥੇਬੰਦੀਆਂ ਵਲੋਂ ਕਈ ਮੀਟਿੰਗਾਂ ਕਰਨ ਤੋਂ ਬਾਅਦ ਭਜਿੇ ਆ ਗਿਆ ਪ੍ਰਸਤਾਵ ਪੱਤਰ ਤਾਂ ਬੱਸ ਨਵੀਂ ਬੋਤਲ ਵਿੱਚ ਪੁਰਾਣੀ ਸ਼ਰਾਬ ਵਰਗਾ ਹੀ ਹੈ ਅਤੇ ਜਾਂ ਕਹਿ ਲਵੋ ਕਿ ਮਿਆਦ ਲੰਘੀ ਦਵਾਈ ਨੂੰ ਨਵੇਂ ਲੇਬਲ ਅਧੀਨ ਦਿੱਤਾ ਜਾ ਰਿਹਾ ਹੈ।",
                "ਇਸ ਪ੍ਰਸਤਾਵ ਪੱਤਰ ਵਿੱਚ ਬਾਰ ਬਾਰ ਇਹ ਗੱਲ ਦੁਹਰਾਉਣੀ ਕਿ ਅੱਖਰ ਅੱਖਰ ਸੋਧ ਕਰਵਾ ਲਵੋ ਪਰ ਕਾਨੂੰ ਨਾਂ ਬਾਰੇ ਰੱਦ ਸ਼ਬਦ ਦੀ ਵਰਤੋਂ ਨਾ ਕਰੋ, ਨੇ ਇਹ ਗੱਲ ਤਾਂ ਸਪੱਸ਼ਟ ਕਰ ਦਿੱਤੀ ਹੈ ਕਿ ਸਰਕਾਰ ਦੇ ਬਣਾਏ ਕਾਨੂੰ ਨ ਕਿਸਾਨ ਹਿੱਤਾਂ ਵਿੱਚ ਨਹੀਂ ਹਨ ਅਤੇ ਬਹੁਤ ਹੀ ਅਸਪੱਸ਼ਟ ਹਨ ਤਾਂ ਹੀ ਤਾਂ ਅੱਖਰ ਅੱਖਰ ਸੋਧ ਦਾ ਨਜ਼ਰੀਆ ਪੇਸ਼ ਕੀਤਾ ਗਿਆ ਹੈ ਅਤੇ ਦੂਸਰਾ ਸਰਕਾਰ ਹੁਣ ਰੱਦ ਕਰਨਾਂ ਸ਼ਬਦ ਦੀ ਵਰਤੋਂ ਤੋਂ ਗੁਰੇਜ ਕਰਕੇ ਆਪਣੀਆਂ ਨਾਕਾਮੀਆਂ ਨੂੰ ਪਰਦਾਪੋਸ਼ ਕਰਨਾ ਚਾਹੁੰਦੀ ਹੈ।ਜੇਕਰ ਸਰਕਾਰ ਦੇ ਭੇਜੇ ਪ੍ਰਸਤਾਵ ਪੱਤਰ ਨੂੰ ਅੱਖਰ ਅੱਖਰ ਵਾਚਿਆ ਜਾਵੇ ਤਾਂ ਉਹ ਵੀ ਬੱਸ ਕਿਸਾਨ ਜਥੇਬੰਦੀਆਂ ਨੂੰ ਇਹ ਅਹਿਸਾਸ ਕਰਾਉਣ ਦਾ ਯਤਨ ਹੈ ਕਿ ਕਾਨੂੰ ਨ ਤਾਂ ਕਿਸਾਨਾਂ ਦੇ ਹਿੱਤਾਂ ਵਿੱਚ ਹਨ ਪਰ ਕਿਸਾਨਾਂ ਦੀ ਨਿਮਨ ਮਾਨਸਿਕਤਾ ਇਹਨਾਂ ਦੇ ਦੂਰ ਅੰਦੇਸ਼ ਫਾਇਦਿਆਂ ਨੂੰ ਸਮਝਣ ਤੋਂ ਅਸਮਰੱਥ ਹੈ।",
                "ਇਹ ਵੀ ਜ਼ਿਕਰਯੋਗ ਹੈ ਕਿ ਇਸ ਵਾਰੀ ਜਿਥੇ ਕਿਸਾਨ ਜਥੇਬੰਦੀਆਂ ਦੇ ਆਗੂ ਲੈਣ ਵਾਲੇ ਫੈਸਲਿਆਂ ਪ੍ਰਤੀ ਬਹੁਤ ਹੀ ਸੁਚੇਤ ਹਨ ਉਥੇ ਨਾਲ ਹੀ ਉਹਨਾਂ ਦੀ ਨੌਜਵਾਨ ਪੀੜਹੀ ੍ ਪੂਰੀ ਤਰ੍ਹਾਂ ਨਾਲ ਜਾਗਰੁਕ ਅਤੇ ਸਮਾਜਿਕ ਮਾਧਿਅਮਾਂ ਨਾਲ ਜੁੜੀ ਹੋਣ ਕਰਕੇ ਹਰ ਨੁਕਤੇ ਤੋਂ ਜਾਣਕਾਰ ਅਤੇ ਸੂਖਮ ਪੱਧਰ ਤੱਕ ਜਾਣੂ ਹੈ।",
                "ਹੁਣ ਸਰਕਾਰ ਦੇ ਪ੍ਰਸਤਾਵ ਪੱਤਰ ਦੇ ਲੁਕਵੇਂ ਮੰਤਵ ਨੂੰ ਫਰੋਲੀਏ ਤਾਂ ਉਹ ਝੂ ਠ ਦੇ ਪੁਲੰਦੇ ਤੋਂ ਵੱਧ ਕੁਝ ਵੀ ਨਹੀਂ। ਉਹ ਬੱਸ ਵੱਡੇ ਸਨਅਤੀ ਘਰਾਣਿਆ ਦਾ ਸਰਕਾਰੀ ਮੋਢਾ ਵਰਤ ਕੇ ਦਾਗਿਆ ਗਿਆ ਗੋਲਾ ਹੀ ਸਮਝਿਆ ਜਾ ਸਕਦਾ ਹੈ।ਜਿਸ ਵਿੱਚ ਖਰੀਦ ਕਾਨੂੰ ਨਾਂ ਦੀ ਲਗਾਤਾਰਤਾ ਅਤੇ ਸਥਿਰਤਾ ਦਾ ਵਿਸ਼ਵਾਸ ਦਵਾਉਣ ਦਾ ਯਤਨ ਕੀਤਾ ਗਿਆ ਹੈ ਪਰ ਜਦੋਂ ਸਰਕਾਰੀ ਖਰੀਦ ਕੇਂਦਰਾਂ ਦੇ ਸਾਹਮਣੇ ਨਿਜੀ ਅਦਾਰੇ ਆਪਣੀ ਖਰੀਦ ਸ਼ੁਰੂ ਕਰਨਗੇ ਤਾਂ ਕਿੰਨਾ ਕੁ ਚਿਰ ਸਰਕਾਰੀ ਖਰੀਦ ਕੇਂਦਰਾਂ ਨੂੰ ਕਾਇਮ ਰੱਖਿਆ ਜਾ ਸਕਦਾ ਹੈ?ਇਹ ਤਾਂ ਸਪੱਸ਼ਟ ਹੈ ਕਿ ਸਰਕਾਰੀ ਖਰੀਦ ਕੇਂਦਰ ਅਤੇ ਏਜੰਸੀਆਂ ਖਤਮ ਕੀਤੀਆਂ ਜਾਣਗੀਆਂ ਕੁਝ ਸਮਾਂ ਨਿਜੀ ਅਦਾਰਿਆਂ ਤੋਂ ਵਧੀਆ ਮੁੱਲ ਦਵਾ ਕੇ ਅਤੇ ਇਸ ਤੋਂ ਬਾਅਦ ਸਰਕਾਰੀ ਖਰੀਦ ਨੂੰ ਅਸਰਅੰਦਾਜ਼ ਕੀਤਾ ਜਾਵੇਗਾ ਅਤੇ ਉਸ ਤੋਂ ਬਾਅਦ ਇਸ ਦੇ ਬੰਦ ਹੋਣ ਦਾ ਭਾਂਡਾ ਵੀ ਕਿਸਾਨਾਂ ਦੇ ਸਿਰ ਭੰਨ ਕੇ ਸਾਰੇ ਅਧਿਕਾਰ ਨਿਜੀ ਸਨਅੱਤੀ ਘਰਾਣਿਆਂ ਨੂੰ ਦਿੱਤੇ ਜਾਣਗੇ।",
                "ਜਿਨਸ ਦੇ ਭੰਡਾਰ ਦੇ ਸੋਧਾਂ ਨੇ ਕਾਨੂੰ ਨ ਦੇ ਅਧੀਨ ਕਾਲਾ ਬਜ਼ਾਰੀ ਵਧੇਗੀ ਅਤੇ ਕਿਸਾਨ ਕੋਲੋਂ ਸਸਤੇ ਭਾਅ ਖਰੀਦੀ ਜਿਣਸ ਨਿਜੀ ਅਦਾਰੇ ਆਪਣੇ ਮਰਜ਼ੀ ਦੇ ਮੁੱਲ ਉਪਰ ਲੋੜਵੰਦਾਂ ਨੂੰ ਵੇਚਣਗੇ।ਬੇਸ਼ਕ ਕਹਾ ਜਾ ਰਿਹਾ ਹੈ ਕਿ ਭੰਡਾਰ ਅਤੇ ਸੰਭਾਲ ਦੇ ਹੱਕ ਕਿਸਾਨ ਕੋਲ ਹੋਣਗੇ ਪਰ ਸਵਾਲ ਇਹ ਹੈ ਕਿ ਕਿਸਾਨ ਕੋਲ ਆਪਣੀ ਉਪਜ ਨੂੰ ਲੰਮਾ ਸਮਾਂ ਭੰਡਾਰ ਕਰਨ ਅਤੇ ਸੰਭਾਲ ਦੀ ਸਮਰੱਥਾ ਅਤੇ ਸਾਧਨ ਉਪਲਬਧ ਹਨ?",
                "ਸੋ ਸਰਕਾਰ ਦਾ ਪਥਸਤਾਵ ਪੱਤਰ ਜੋ ਕਿ ਕਿਸਾਨ ਜਥੇਬੰਦੀਆਂ ਵਲੋਂ ਰੱਦ ਕੀਤਾ ਹੈ ਦਰਅਸਲ ਕਿਸਾਨ ਜਾਂ ਕਿਸਾਨ ਦੀਆਂ ਮੰਗਾਂ ਪੱਖੀ ਨਹੀਂ ਬਲਕਿ ਸਰਕਾਰੀ ਸਰਪ੍ਰਸਤੀ ਵਾਲੇ ਵੱਡੇ ਸਨਅਤਕਾਰੀ ਘਰਾਣਿਆਂ ਦਾ ਸਾਜਿਸ਼ੀ ਪੱਤਰ ਹੀ ਕਿਹਾ ਜਾ ਸਕਦਾ ਹੈ ਜਿਸ ਨੂੰ ਰੱਦ ਕਰਕੇ ਕਿਸਾਨਾਂ ਨੇ ਆਪਣੀ ਜਾਗਰੂਕਤਾ ਅਤੇ ਰੋਸ਼ਨ ਦਿਮਾਗੀ ਦਾ ਸਬੂਤ ਦਿੱਤਾ ਹੈ।"
            ]
        },
        {
            id: 3,
            title: "ਸੰਘਰਸ਼ ਅਤੇ ਕਲਾ ",
            writter: "ਜਤਿੰਦਰ ਮੌਹਰ",
            description: [
                "ਜਿਹੜੀਆਂ ਫ਼ਿਲਮਾਂ ਅਸੀਂ ਦੇਖਦੇ ਹਾਂ| ਨਾਵਲ, ਕਹਾਣੀਆਂ ਪੜਦੇ ੍ਹ ਹਾਂ। ਕਲਾ ਦੇ ਕਿਸੇ ਵੀ ਰੂਪ ਬਾਰੇ ਬਹੁਤ ਕੁਝ ਲਿਖਿਆ ਅਤੇ ਬੋਲਿਆ ਜਾ ਸਕਦਾ ਹੈ ਪਰ ਜੇ ਥੋੜੇ ਜਿਹੇ ਸ਼ਬਦਾਂ ਵਿਚ ਲਿਖਣਾ ਹੋਵੇ ਕਿ ਕਲਾ ਕੀ ਹੈ? ਮੈ ਕਹਾਂਗਾ ਕਲਾ ਇਕ ਅਜਿਹਾ ਵਸੀਲਾ ਹੈ ਜਿਹੜਾ ਬੰਦੇ ਨੂੰ ਬੰਦੇ ਨਾਲ ਜੋੜਦਾ ਹੈ। ਬੰਦੇ ਦੀ ਸੰਵੇਦਨਾ ਨੂੰ ਦੂਜੇ ਬੰਦ ਤੱਕ ਪੁਚਾਉਦਾ ਹੈ। ਸਾਹਮਣੇ ਵਾਲੇ ਦੇ ਦੁੱਖ-ਸੁੱਖ ਦਾ ਅ ਂ ਹਿਸਾਸ ਬੰਦੇ ਨੂੰ ਕਰਵਾਉਦੀ ਹੈ। ਕਲਾ ਤੁਹਾਡੇ ਅੰਦਰ ਅ ਂ ਜਿਹਾ ਭਾਵ ਜਗਾ ਦਿੰਦੀ ਹੈ ਕਿ ਜੋ ਸਾਹਮਣੇ ਵਾਲੇ ਦੇ ਅੰਦਰ ਚੱਲ ਰਿਹਾ ਹੈ ਉਹ ਤੁਹਾਨੂੰ ਮਹਿਸੂਸ ਹੁੰਦਾ ਹੈ।",
                "ਕਲਾ ਵਾਂਗੂ ਘੋਲ ਵੀ ਬੰਦੇ ਨੂੰ ਬੰਦੇ ਦੇ ਨੇੜੇ ਲੈਕੇ ਆਉਦੇ ਂ ਨੇ। ਕਲਾ ਅਤੇ ਸੰਘਰਸ਼ ਦਾ ਇਹ ਰਿਸ਼ਤਾ ਵੀ ਹੈ ਅਤੇ ਕੰਮ ਵੀ। ਘੋਲ ਵਿਚ ਬੰਦਾ ਕਹਿੰਦਾ ਹੈ ਤੇਰੀ ਮੇਰੀ ਲੜਾਈ ਇਕ ਹੈ ਅਤੇ ਤੇਰੀ ਮੇਰੀ ਜਿੰਦਗੀ ਇਕ ਹੈ। ਅਸੀਂ ਮਿਲ ਕੇ ਕੋਈ ਹੱਲ ਕੱਢ ਸਕਦੇ ਹਾਂ। ਕਲਾਕਾਰ ਨੇ ਇਹ ਫੈਸਲਾ ਕਰਨਾ ਹੁੰਦਾ ਹੈ ਕਿ ਉਹਨੇ ਹੱਕ ਖੋਹਣ ਵਾਲਿਆਂ ਦੇ ਨਾਲ ਖੜਨਾ ਹੈ ਕਿ ਹੱਕ ਲੈਣ ਵਾਲਿਆਂ ਦੇ ਨਾਲ।",
                "ਜੇ ਕੋਈ ਕਲਾ ਬੰਦੇ ਨੂੰ ਬੰਦੇ ਦੀ ਇੱਜਤ ਕਰਨੀਂ ਨਹੀਂ ਸਿਖਾਉਦੀ। ਜੇ ਉਹ ਸਾਹਮਣੇ ਵਾਲੇ ਕ ਂ ਿਰਤੀ ਬੰਦੇ ਨੂੰ ਦੁਸ਼ਮਣ ਗਰਦਾਨਦੀ ਹੈ ਤਾਂ ਉਹ ਕਲਾ ਥੁੜਚਿਰੀ ਅਤੇ ਖਤਰਨਾਕ ਹੈ। ਇਸੇ ਤਰਾਂ ਜੇ ਕੋਈ ਘੋਲ ਤੁਹਾਡੇ ਉਤਮ ਹੋਣ ਦਾ ਗੁਮਾਨ ਤੁਹਾਡੇ ਅੰਦਰ ੱ ਪੈਦਾ ਕਰਦਾ ਹੈ। ਜਿਸ ਵਿਚ ਕਿਸੇ ਹੋਰ ਧਰਮ, ਨਸਲ, ਜਾਤ ਜਾਂ ਕਿਸੇ ਹੋਰ ਖ਼ਿੱਤੇ ਦੇ ਬੰਦੇ ਨੂੰ ਬੰਦਾ ਨਹੀਂ ਸਮਝਿਆ ਜਾਂਦਾ ਤਾਂ ਉਹ ਘੋਲ ਵੀ ਖਤਰਨਾਕ ਹੁੰਦਾ ਹੈ। ਹੱਕ ਦੇ ਸੱਚ ਦੇ ਸੰਘਰਸ਼ ਵਿਚ ਲੱਗੇ ਸਾਡੇ ਕਿਸਾਨ ਮਜ਼ਦੂਰ ਵੀਰ ਅਤੇ ਭੈਣਾਂ ਬਿਹਤਰ ਮਨੁੱ ਖੀ ਜਿੰਦਗੀ ਦੇ ਸੁਫ਼ਨੇ ਨੂੰ ਸਾਕਾਰ ਕਰਨ ਦਾ ਉਜਰ ਕਰ ਰਹੇ ਹਨ। ਜਿਥੇ ਸਭ ਨਾਲ ਇਨਸਾਫ਼ ਹੋਵੇਗਾ । ਸਭ ਲਈ ਰੋਟੀ ਹੋਵੇਗੀ। ਸਭ ਮਾਣ ਨਾਲ ਜਿੰਦਗੀ ਜਿਊਣਗੇ। ਸਰਬਤ ਦਾ ਭਲਾ ਮੰਗਣ ਵਾਲੇ ਸੰਘਰਸ਼ਾਂ ਅਤੇ ਕਲਾ ਨੂੰ ਸਲਾਮ।"
            ]
        },
        {
            id: 4,
            title: "ਪੜਨ ਦੀ ਤਾਂਘ",
            writter: "ਜੱਸੀ ਸੰਘਾ",
            description: [
                "ਜਿਵੇਂ ਕਿ ਤੁਹਾਨੂੰ ਫ਼ੋਟੋ ਦੇਖ ਕੇ ਅੰਦਾਜ਼ਾ ਹੋ ਗਿਆ ਹੋਵੇਗਾ, ਬਾਪੂ ਜੀ ਇਕੱਲੇ ਬੈਠੇ ਇੱਕ ਕਾਗਜ਼ ਨੂੰ ਅੱਖਾਂ ਦੇ ਬਹੁਤ ਹੀ ਨੇੜੇ ਕਰਕੇ ਪੜਨ ੍ਹ ਦੀ ਕੋਸ਼ਿਸ਼ ਕਰ ਰਹੇ ਸਨ| ਮੈਂ ਧਰਨੇ ਵਿੱਚ ਸ਼ਾਮਿਲ ਬਜ਼ੁਰਗਾਂ ਦੀਆਂ ਫ਼ੋਟੋਆਂ ਖਿੱਚ ਰਹੀ ਸੀ ਤਾਂ ਮੇਰੇ ਦੋਸਤ ਇੰਦਰ ਨੇ ਮੈਨੂੰ ਇਸ਼ਾਰਾ ਕਰਕੇ ਇਹਨਾਂ ਦੀ ਫ਼ੋਟੋ ਕਰਨ ਨੂੰ ਕਿਹਾ| ਪਰ ਬਾਪੂ ਵੱਲ ਜਦੋਂ ਮੈਂ ਧਿਆਨ ਨਾਲ ਦੇਖਿਆ ਤਾਂ ਫ਼ੋਟੋ ਕਰਨ ਤੋਂ ਪਹਿਲਾਂ ਹੀ ਮੈਂ ਧਾਰ ਲਿਆ ਸੀ ਕਿ ਮੈਂ ਕੋਲ ਜਾ ਕੇ ਗੱਲਬਾਤ ਕਰਾਂਗੀ| ਸੋ ਫ਼ੋਟੋ ਕਰਨ ਤੋਂ ਬਾਅਦ ਮੈਂ ਕੋਲ ਜਾ ਕੇ ਪੁੱਛਿਆ ਕਿ ਬਾਪੂ ਜੀ ਐਨਕ ਘਰ ਰਹਿ ਗਈ? ਕਹਿੰਦੇ, “ਨਾ ਪੁੱਤ, ਮੈਨੂੰ ਚੱਜ ਨਾਲ ਪੜਨਾ ਨਹੀਂ ਆਉਦਾ, ਂ ਬੱਸ ਅੱਖਰ ਪਛਾਣ ਲੈਨਾਂ ਆਂ, ਜੋੜ ਜੋੜ ਕੇ ਕੋਈ ਕੋਈ ਅੱਖਰ ਉਠ ੱ ਖੜਦਾ!” ਮੈਂ ਪੁੱਛਿਆ ਕਿ ਬਾਪੂ ਜੀ, ਮੈਂ ਪੜ ਕੇ ਸੁਣਾਵਾਂ! ਕ ੍ਹ ਹਿੰਦੇ ਕਿ ਫੇਰ ਤਾਂ ਪੁੱਤ ਮੇਰਿਆ ਕਮਾਲ ਹੋਜੂ!",
                "ਸੰਯੁਕਤ ਕਿਸਾਨ ਕਮੇਟੀ ਵੱਲੋਂ ਛਾਪਿਆ 4-5 ਪੰਨਿਆਂ ਦਾ ਪਰਚਾ ਸੀ, ਮੈਂ ਪੜਦੀ ਰਹੀ ਤੇ ਯਕੀਨ ਮੰ ੍ਹ ਨਿਓ ਬਾਪੂ ਜੀ ਉਸਦੀ ਵਿਆਖਿਆ ਕਰਦੇ ਰਹੇ| ਉਹਨਾਂ ਦੀ ਉਮਰ 85 ਵਰ੍ ਹੈ, ਹੇ ਲੁਧਿਆਣਾ ਜ਼ਿਲ੍ਹੇ ਦੇ ਪਿੰਡ ਝੋਰੜਾਂ ਦੇ ਵਸਨੀਕ ਹਨ| ਗੱਲ ਕਰਦਿਆਂ ਈ ਬਾਪੂ ਨੇ ਜੇਬ ਵਿੱਚੋਂ ਇੱਕ ਬਹੁਤ ਪੁਰਾਣੀ ਜਿਹੀ ਨਿੱਕੀ ਜਿਹੀ ਡਾਇਰੀ ਕੱਢੀ ਤੇ ਮੈਨੂੰ ਮੇਰਾ ਨਾਮ ਲਿਖ ਕੇ ਦੇਣ ਨੂੰ ਕਿਹਾ! ਮੈਂ ਕਿਹਾ ਨੰ ਬਰ ਲਿਖ ਦਵਾਂ? ਕਹਿੰਦੇ, “ਧੀਏ ਪਿੰਡ ਦਾ ਨਾਂ ਲਿਖ ਦੇ, ਮੈਂ ਤੇਰੇ ਪਿੰਡ ਵੱਲ ਜਦੋਂ ਵੀ ਆਇਆ, ਮੈਂ ਤੈਨੂੰ ਲੱਭ ਕੇ ਮਿਲਣ ਆਊਗਾ, ਂ ਤੂੰ ਮੈਨੂੰ ਅੱਜ ਬਹੁਤ ਕੁਝ ਸਿਖਾਇਆ|” ਪਰ ਦਰਅਸਲ ਮੈਂ ਸਿਰਫ਼ ਪੜ ਕੇ ਸੁਣਾਇਆ ਸੀ, ੍ਹ ਸਿਖਾਇਆ ਤਾਂ ਬਾਪੂ ਜੀ ਨੇ ਮੈਨੂੰ ਸੀ|",
                "ਓਨੇ ਵਿੱਚ ਈ ਮੈਂ ਦੇਖਿਆ ਕਿ ਬਾਪੂ ਕੋਲ ਕੰਬਲ ਨਹੀਂ ਦੀਂਹਦਾ ਤੇ ਉਸ ਸ਼ਾਮ ਮੀਂਹ ਤੋਂ ਬਾਅਦ ਠੰ ਡ ਬੜੀ ਵਧ ਗਈ ਸੀ| ਪੁੱਛਣ ‘ਤੇ ਪਤਾ ਲੱਗਿਆ ਕਿ ਉਹ ਘਰੋਂ ਲੈ ਕੇ ਨਾ ਆਏ ਤੇ ਏਧਰ ਨੇੜੇ ਕੋਈ ਵੰਡ ਵੀ ਨਹੀਂ ਸੀ ਰਿਹਾ| ਨੇੜੇ ਲੱਗੀ ਇੱਕ ਟਰਾਲੀ ਕੋਲ ਖੜੇ ਰੋਟੀ ਖਾਂਦੇ ਨੌਜਵਾਨਾਂ ਨੂੰ ਬੇਨਤੀ ਕੀਤੀ ਕਿ ਉਹ ਬਾਪੂ ਨੂੰ ਰਜਾਈ ਦਾ ਬੰਦੋਬਸਤ ਕਰ ਦੇਣ| ਉਹਨਾਂ ਵਾਅਦਾ ਕੀਤਾ ਕਿ ਉਹ ਕਰਨਗੇ| ਮੈਂ ਕਾਹਲੀ ਵਿੱਚ ਉਹਨਾਂ ਦਾ ਨੰ ਬਰ ਵੀ ਨਾ ਲਿਆ, ਪਰ ਖ਼ੁਦ ਨੂੰ ਕੰਬਲ ਵਿੱਚ ਬੈਠਿਆਂ ਝੋਰਾ ਬਾਪੂ ਦਾ ਈ ਖਾ ਰਿਹਾ ਸੀ|",
                "ਘੰਟੇ ਕੁ ਬਾਅਦ ਉਹਨਾਂ ਮੁੰਡਿਆਂ ਵਿੱਚ ਇੱਕ ਵੀਰ ਦਾ ਇੰਸਟਾਗ੍ਰਾਮ ‘ਤੇ ਸੁਨੇਹਾ ਆ ਗਿਆ ਕਿ ਭੈਣੇ ਬਾਪੂ ਜੀ ਨੂੰ ਰਜ਼ਾਈ ਦੇ ਦਿੱਤੀ, ਅਸੀਂ ਟਰਾਲੀ ਵਿੱਚ ਸੌਣ ਦੀ ਬੇਨਤੀ ਵੀ ਕੀਤੀ ਕਿ ਇੱਥੇ ਨਿੱਘ ਹੈ, ਪਰ ਬਾਪੂ ਜੀ ਨੇ ਇਹ ਕਹਿ ਕੇ ਮਨਾਂ ਕਰ ਦਿੱਤਾ ਕਿ ਪੁੱਤਰ ਜੇ ਮੈਂ ਇਥੋਂ ਉਠ ਖੱ ੜਿਆ ਤਾਂ ਇਹ ਯੁੱਧ ਦੇ ਮੈਦਾਨ ਵਿੱਚੋਂ ਭੱਜਣ ਵਾਲੀ ਗੱਲ ਹੋਵੇਗੀ| ਸੋ ਬਾਪੂ ਜੀ ਜ਼ਮੀਨ ‘ਤੇ ਵਿਛੀ ਦਰੀ ‘ਤੇ ਈ ਸੁੱਤੇ|",
                "ਮੇਰੇ ਪਿਆਰੇ ਵੀਰੋ ਤੇ ਭੈਣੋ ਇਹ 85 ਸਾਲ ਦੇ ਸਾਡੇ ਇੱਕ ਦਾਦੇ ਦੇ ਹੌਂਸਲੇ ਤੇ ਗਿਆਨ ਦੀ ਮਿਸਾਲ ਹੈ| ਸਾਡੇ ਹਜ਼ਾਰਾਂ ਦਾਦੇ-ਦਾਦੀਆਂ ਤੇ ਮਾਪੇ ਇਥੇ ਇਹੋ ਜਿਹੇ ਹੌਂਸਲੇ ਲਈ ਬੈਠੇ ਨੇ ਤਾਂ ਫੇਰ ਭਲਾ ਅਸੀਂ ਚੜਦੀ ਕਲਾ ‘ਚ ਕਿਉ ਨਾ ਰਹੀਏ|"
            ]
        },
        {
            id: 5,
            title: "ਦੋ ਕਿਸਾਨ",
            writter: "ਤਨਵੀਰ",
            description: [
                "ਮੇਰਾ ਗੁਆਂਢੀ ਪਿੰਡ ਹੈ ਬੱਪੀਆਣਾ। ਇਥੋਂ ਦੋ ਕਿਸਾਨ ਦਿੱਲੀ ਗਏ ਨੇ। ਧਰਨੇ ਚ। ਦੋਵਾਂ ਦੀ ਵੱਟ ਸਾਂਝੀ ਹੈ। ਇਕ ਦਾ ਮੁਰਗ਼ੀ ਫ਼ਾਰਮ ਹੈ। ਲੜੇ ਹੋਏ ਨੇ, ਬੋਲਚਾਲ ਬੰਦ ਹੈ। ਇਕ ਨੇ ਦੂਜੇ ‘ਤੇ ਕੇਸ ਕੀਤਾ ਹੋਇਆ ਹੈ। ਕੇਸ ਕਰਨ ਵਾਲਾ ਸਵੇਰੇ ਦੂਜੇ ਨੂੰ ਆਖਦਾ ਹੈ-ਲੈ ਬਾਈ ਚਾਹ ਪੀ ਲੈ। ਇਹ ਕੋਲ ਹੀ ਬੈਠ ਜਾਂਦਾ ਹੈ। ਥੋੜਾ ਚਿਰ ਚੁੱਪ ਰਹਿ ਆਖਦਾ ਹੈ- ਬਾਈ ਪਹਿਲਾਂ ਤਾਂ ਜਾਣ ਸਾਰ ਤੇਰੇ ਵਿਰੁੱਧ ਕੇਸ ਵਾਪਸ ਲਊ ਯਰ। ਦਿੱਲੀ ਹਾਰ ਗਈ ਹੈ। ਦੋਵੇਂ ਕੇਸ ਜਿੱਤ ਗਏ ਨੇ।"
            ]
        }
    ]
    return (
        <div className="accordion punjabi-wrapper" id="accordionExample">
            <ul className="list-group list-group-horizontal mt-2 mb-2">
                <li className="list-group-item"><Link to="/" className="btn">English</Link></li>
                <li className="list-group-item"><Link to="/punjabi" className="btn">Punjabi</Link></li>
            </ul>

            {newsData.map(news => (
                <Collapsible className="bg-light" trigger={news.title} key={news.id}>
                    <p>{news.Writter}</p>
                    {news.description.map((desc, index) => (
                        <p key={index}>{desc}</p>
                    ))}
                </Collapsible>
            ))}
            <hr />
            {data.length === 0 ? <div className="spinner-grow" role="status">
                <span className="visually-hidden">Loading...</span>
            </div> : (data.map(news => (
                <Collapsible className="bg-light" trigger={news.title} key={news.id}>
                    {news.description.map((desc, index) => (
                        <p key={index}>{desc}</p>
                    ))}
                </Collapsible>)

            ))}
        </div>
    )
}

export default Punjabi
